{"intents": [
        {"tag": "opsi",
         "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered"],
         "responses": ["Hello. I can help you to answer your complaints in Traveloka."]
        },
        {"tag": "payBookingIndoAlfa",
        "patterns": ["How to pay booking in Indomaret", "How to pay booking in Alfamart", "Can I pay booking in Indomaret",  "Can I pay booking in Alfamart", "I want to pay booking in Indomaret", "I want to pay booking in Alfamart", "pay booking in indomaret", "pay booking in Alfamart", "pay in Indomaret"],
        "responses": ["To pay for your booking via Indomaret or Alfamart, follow these steps: \n \n1. After you've completed your booking details, choose Indomaret or Alfamart on the payment page. \n2. Tap Pay at Indomaret/Alfamart. \n3. Go to the nearest Indomaret/Alfamart and show your payment code to the cashier. Then, make the payment. Make sure to ask the cashier for the receipt. \n4. Once your payment at Indomaret or Alfamart is completed, your Traveloka e-ticket/voucher and receipt will be sent to the email address you used for booking within 60 minutes. \n \n Things to note: \n \n1. For each transaction, Alfamart charges a fee of Rp2.500 while Indomaret charges Rp5.000. \n2. Payment via Indomaret or Alfamart is only available for transactions amounting up to Rp5.000.000. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/paying-in-idr/how-to-pay-for-my-booking-via-indomaret-or-alfamart"]
        },
        {"tag": "scanQRCode",
        "patterns": ["How to use qr code", "what is steps for using qr code", "can i use qr code to scan", "how to scan qr code", "what should i do to scan qr code", "does traveloka has qr code scanner", "scan qr code"],
        "responses": ["The Traveloka QR code scanner can read QR codes that belong to Traveloka and its partners. You can use the scanner to find more information about a Traveloka product or service and to unlock special discounts at Traveloka's events or partner merchants. \nTo use the QR code scanner, simply tap the icon at the top right of your Traveloka App homepage, enable camera permission, and scan the QR code. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/traveloka-qr-scanner/about-the-traveloka-qr-code-scanner"]
        },
        {"tag": "confirmationPayment",
        "patterns": ["how to confirm my payment", "can i confirm my payment", "how to check my payment", "is there any confirmation to my payment", "confirmation my payment", "payment confirmation"],
        "responses": ["Your payment is confirmed when you receive your e-ticket/voucher in your email. \nIf you have not received the e-ticket/voucher within 60 minutes after completing your payment, it is possible that you might have entered the wrong one-time password (OTP) (if you paid by credit card), the wrong account number, or the wrong amount (if you paid by bank transfer). \nIn any case, please upload your payment proof so our team can conduct further checking. Here's how you can upload your payment proof on Traveloka desktop website. \n1. Tap your account on the top right corner of the page and select Purchase List. \n2. Select the booking that you have just paid for and click Continue to Payment. Scroll down to Completed Your Payment? and click I Have Completed Payment. \n3. Click Upload Payment Proof. Select the file you want to upload, and click Open. You will be able to see the status of your payment in My Booking. \nYour payment should be verified and you should receive your e-ticket/voucher in approximately 15 minutes after you have uploaded your payment proof. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/i-have-booked-and-completed-my-payment-before-the-time-limit-how-do-i-make-sure-that-my-payment-has-been-received"]
        },
        {"tag": "findPromos",
        "patterns": ["how to find latest promos", "can i find latest promos", "how i find latest promos", "how i search latest promos", "latest promos on traveloka", "promos on traveloka"],
 		"responses": ["You can check the latest promo deals by visiting the Traveloka homepage. To see all ongoing promos, you can click on the Promos menu at the top of the page. \nTo see the latest promo deals on your Traveloka App, go to the homepage. Tap Ongoing Promos to see the promos for all product categories. Simply tap on any promo that interests you. Be sure to read the Terms & Conditions for each promo deal. \nOn any other page on your Traveloka App, you can check out the latest promos by tapping on the three dots icon at the top right and tap Ongoing Promos. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/promo-info/how-to-find-the-latest-promos-on-traveloka"]
        },
        {"tag": "payInstallments",
        "patterns": ["how can i pay installments", "what should i do to pay installments", "can i pay installments", "how to pay installments", "pay installments", "paying installments"],
        "responses": ["Make a booking at Traveloka, then choose Credit Card as your payment method. If your transaction meets the Terms & Conditions, the option will appear. Then, choose the tenure which you prefer and click on \"Pay Now\" to proceed.\n For further information: https://www.traveloka.com/en-id/help/general-info/general-information-payment/installment/how-can-i-pay-in-installment."]
        },
        {"tag": "deactivateAccount",
         "patterns": ["How to deactivate account", "i want to deactivate account", "deactivate account", "i wanna deactivate my account", "how to erase account", "how to delete account", "erase account", "delete account"],
         "responses": ["To deactivate your account, you can Contact Us. Please prepare your ID card before contacting our Customer Service. \nFor further information: https://www.traveloka.com/en-id/help/profile-security/profile-security-info/general-information/how-to-deactivate-my-account"]
        },
        {"tag": "unknownPasswordReset",
         "patterns": ["I got email that said reset my password", "I receive unknown password reset email", "Unknown password reset", "Unknown password reset email", "Mail password reset unknown"],
         "responses": ["If you receive an email about a password reset that you didn't request, please deactivate your account by following these steps: \n1. On the email, tap Yes, Deactivate My Account. You can also tap on the link sent to you via SMS. After that, you will not be able to log in to your account. \n2. Contact our Customer Service. We will conduct an investigation regarding the safety of your account and let you know when it's safe to log in to your account again. \nFor further information: https://www.traveloka.com/en-id/help/profile-security/profile-security-info/account-security/unknown-password-reset"]
        },
        {"tag": "addEmailHp",
         "patterns": ["how to add email", "how to add mobile number", "can i add email", "can i add mobile number", "i want to add email", "i want to add mobile number"],
         "responses": ["To add your email address/mobile number, follow these steps: \n1. Log in to your Traveloka account on Traveloka App and then go to My Account. \n2. Tap Settings. Under Account & Security, tap Account Information. \n3. To add a new email address/mobile number, tap Add Email or Add Mobile Number. \n4. Enter your new email address/mobile number, then tap Save. \n5. Select the email address/mobile number to receive your verification code, then tap Submit. \n6. Once you receive the verification code, enter the code and tap Send. \n7. Tap Verify on your new email address/mobile number on My Account to get another verification code. Enter the code and tap Send. Please note that you will not get a verification code if you add an email address/mobile number that has been registered to another Traveloka account. \nTo remove your email address/mobile number, tap on the ellipsis button next to the email address/mobile number, then tap Remove.\nFor further information: https://www.traveloka.com/en-id/help/profile-security/profile-security-info/general-information/how-to-add-or-remove-an-email-address-mobile-number"]
        },
        {"tag": "payBooking",
         "patterns": ["how to pay booking", "where can i to pay the booking", "i wanna pay my booking", "what method to pay my booking", "pay booking", "pay my booking", "way to pay booking", "where to pay booking", "method payment to pay booking"],
         "responses": ["Pay for your booking by following these steps: \n1. After completing your booking details, select your preferred payment method. \n2. Tap the Pay with button. \nPlease make sure to settle your payment before the time limit expires. To check how much time you have left to settle your payment, go to Purchase List. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/how-to-pay-for-my-booking"]
        },
        {"tag": "checkPaymentStatus",
         "patterns": ["where can i check my payment status", "how can i to check my payment status", "check payment status", "check my payment status", "i want to check my payment status", "can i check my payment status", "where to check payment status", "how to check payment status"],
         "responses": ["If you're logged in to your Traveloka account, you can find your payment status via My Booking. Otherwise, you can find it by clicking Retrieve Booking on the Traveloka homepage. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/has-my-payment-been-received"]
        },
        {"tag": "travelokaBankAccount",
        "patterns": ["what is traveloka bank account", "what is traveloka's bank name", "traveloka's bank name", "traveloka bank name", "i wanna know traveloka's bank account", "what is traveloka bank", "traveloka's account name"],
        "responses": ["When you select Transfer or ATM as your payment method during booking, you will see the payment instruction along with Traveloka's bank account details. The same payment instruction will also be sent to your email. Please make sure your transferred amount goes to a bank account under the name of PT Trinusa Travelindo.\nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/i-want-to-pay-via-bank-transfer-how-do-i-know-travelokas-bank-account-details"]
        },
        {"tag": "unsuccessfulTransaction",
        "patterns": ["my credit card transaction is fail", "how to solve unsuccessful credit card transaction", "can i solve my unsuccessful transaction", "i want to solve my transaction", "my transaction is failed", "how to solve failed transaction", "i want to solve failed transaction", "my transaction is fail"],
        "responses": ["Sometimes it can take longer to process your payment. If your first transaction was unsuccessful, please reload the page and try to make the payment again. \nPlease make sure that you enter the correct credit card details (cardholder's name and card number) before trying to make the payment again. Also, if a bank authorization code is required, make sure that you enter the correct code. \nIf your transaction still fails, please check whether: \n1. You have enough credit card limit. \n2. Your credit card can be used for e-commerce transactions. \n3. You have a stable internet connection during transaction. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/why-was-my-credit-card-transaction-unsuccessful"]
        },
        {"tag": "resendOTP",
        "patterns": ["how to resend OTP", "i forgot my OTP", "i did not get my OTP", "can i get OTP once again", "i want to resend OTP", "what should i do to resend OTP"],
        "responses": ["To resend a one-time password (OTP), tap Resend verification code sent via SMS or to your email address. Please check your inbox as well as your junk/spam mailbox. \nFor further information : https://www.traveloka.com/en-id/help/profile-security/profile-security-info/registration-login/how-to-resend-otp"]
        },
        {"tag": "unlockAccount",
        "patterns": ["how to unlock my account", "my account is locked", "i want to unlock my account", "unlock account", "unlock my account", "can i unlock my account", "what should i do to unlock my account"],
        "responses": ["If your account is locked, it means that we have detected a suspicious activity and have therefore secured your account. \nYou can unlock your account by following these steps: \n1. Go to the Traveloka login page and tap Forgot Password?. \n2. Enter the email address/mobile number you registered on Traveloka, then tap Continue. \n3. You will receive a verification code on your email address/mobile number. Enter the code, then tap Submit. \n4. You will be asked to create a new password. \n5. After that, you will be able to log in to your Traveloka account again. \nFor further information : https://www.traveloka.com/en-id/help/profile-security/profile-security-info/registration-login/how-to-unlock-my-account"]
        },
        {"tag": "paidWrongAmount",
        "patterns": ["i paid wrong amount", "paid wrong amount", "i paid payment wrong amount", "how to solve wrong amount payment", "my payment is wrong", "what should i do to solve wrong payment", "i paid the payment bigger", "i paid the payment lesser"],
        "responses": ["If you have made the wrong amount of payment, you can Contact Us. Please prepare your transaction details, such as: \n1. Booking ID \n2. Bank name and account number used to make the transfer \n3. Account holder's name \n4. Amount of payment transferred \n5. Traveloka's bank name and account number the fund was transferred to \n6. Transaction date and time \n7. Transfer channel (ATM/internet banking/mobile banking) \n8. Payment proof\nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/i-paid-the-wrong-amount"]
        },
		{"tag": "eatsVoucherExpirationDate",
        "patterns": ["can i check eats voucher expiration date", "how to check eats voucher expiration date", "check eats voucher expiration date", "what is steps to check eats voucher expiration date", "eats voucher expiration date"],
        "responses": ["Each voucher offers a special deal for a limited time, so you have to redeem it before the expiration date. You can find the voucher's expiration date on the Validity Period section of the voucher. \nFor further information: https://www.traveloka.com/en-id/help/v2/culinary/culinary-dinein/voucher/redemption-info/eats-voucher-expiration-date"]
        },
		{"tag": "eatsRefundDurationProcess",
        "patterns": ["eats refund duration", "How Long Does the Traveloka Eats Refund Process Take?", "how long traveloka eats refund take process", "how many days that i must wait to get my eats refund", "what days that i should wait to get my eats refund"],
        "responses": ["The duration of the refund process depends on your payment choice.\n1. If you choose bank transfer and Alfamart, we will send you a link to the Notification tab on My Inbox page and your email. You will need to submit your bank information through the link and we will process your refund. This may take 2 (two) to 5 (five) working days. \n2. If you choose Uangku, Points, Credit Card, Paylater, or Split Payment, we will transfer the money to your selected payment method automatically within a maximum of 1x24 hours. \nFor further information: https://www.traveloka.com/en-id/help/v2/culinary/culinary-general/cancellation/cancellation/how-long-does-the-refund-process-take"]
        },
		{"tag": "redeemEatsVoucher",
        "patterns": ["how to redeem eats vouher", "can i redeem my eats voucher", "when i can redeem my eats voucher", "what should i do to redeem my eats voucher", "eats voucher redemption steps", "what is steps to redeem my eats voucher"],
        "responses": ["To redeem your Eats Voucher, open it from My Booking and ask the restaurant's staff to redeem it for you. The staff will then swipe the voucher to prove its validity. We recommend that you ask the restaurant staff to redeem your voucher as soon as you arrive at the restaurant to avoid any confusion later on. \nFor further information: https://www.traveloka.com/en-id/help/v2/culinary/culinary-dinein/voucher/redemption-info/redeeming-your-eats-voucher"]
        },
		{"tag": "restaurantRejectsEatsVoucher",
        "patterns": ["why the restaurant reject my eats voucher", "my restaurant reject my voucher", "what should i do when my eats voucher get rejected by restaurant", "how to solve eats voucher rejected by the restaurant", "can i argue when my eats voucher get rejected by the restaurant", "why my eats voucher get rejected by the restaurant", "is there any ways to solve rejection for my eats voucher by the restaurant"],
        "responses": ["Every eat voucher will be valid in a certain period and specific restaurant. Please make sure that you are already at the right branch and the voucher is still within the validity period upon visiting the restaurant. If the restaurant still rejects the booking, please contact our customer service to be checked further. \nFor further information: https://www.traveloka.com/en-id/help/v2/culinary/culinary-dinein/voucher/redemption-info/restaurant-rejects-my-eats-voucher"]
        },
		{"tag": "eatsVoucherErrorRedemption",
        "patterns": ["i have an error when i redeem eats voucher", "eats voucher redemption error", "error redeem eats voucher", "why my eats voucher redemption got error", "how to solve eats voucher redemption error", "why i got error when want to redeem my eats voucher", "i cant redeem my eats voucher", "i cannot redeem my eats voucher", "redemption voucher eats got error"],
        "responses": ["Redemption process should be done at the restaurant and to be done by the cashier. In the case of a failed redemption due to an error system, please kindly contact our customer service along with the screenshot of the error message attached on the report. \nFor further information: https://www.traveloka.com/en-id/help/v2/culinary/culinary-dinein/voucher/redemption-info/eats-voucher-error-redemption"]
        },
        
        {"tag": "BookFlight",
         "patterns": ["how to book a flight", "book a flight", "I want to book a flight", "steps for booking a flight", "I dont know how to book a flight", "how can I book a flight"],
         "responses": ["Book your flight tickets in a few simple steps: \n1. On the Traveloka homepage, tap Flights. Fill in your origin, destination, date of travel, number of passengers, and seat class on the search box, and click Search. \n2. Choose the flight that suits your preference and click Select. \n3. Fill in your Contact Details and Traveler Details according to your travel document.\n4. Choose the payment method you prefer and then complete the payment."]
        },
        {"tag": "ActivateFlightPriceAlerts",
         "patterns": ["how to activate flight price alerts", "activate flight price alerts", "I want to activate flight price alerts", "steps for activate flight price alerts", "I dont know how to activate flight price alerts", "how can I activate flight price alerts"],
         "responses": ["To activate Flight price alerts, follow these steps: \n1. Log in to your Traveloka account on Traveloka App. \n2. Go to My Account, then tap Price Alerts. \n3. Tap the plus button at the bottom right. \n4. Fill in your origin, destination, number of passengers, and seat class. \n5. Under Flight Date, enter dates on Exact Dates when you have fixed travel dates, or on Flexible Dates when you don't. \n6. Under Flight Preferences, select your preffered travel time and number of transits. \n7. Under Notification Settings, enter your preffered notification type and frequency as well as your currency and total budget. \n8. Tap Save."]
        },
        {"tag": "PaySelectSeat",
         "patterns": ["Do I have to pay to select my seat?", "pay to select my seat", "I want to select my seat", "I have to pay to select my seat?", "fee to select my seat fee"],
         "responses": ["Fees and availability are within the authority of the airlines. Some seats are free, while some others come with a fee."]
        },
        {"tag": "ReschedulingFlightHotelBooking",
         "patterns": ["how to reschedule a flight and hotel booking", "I want to reschedule my flight and hotel booking","How do I change a flight and hotel booking?", "Where can I apply for a flight and hotel reschedule?", "can i reschedule my flight and hotel booking?", "What should I do if I want to reschedule flight and hotel booking?"],
         "responses": ["If you need to make changes to your confirmed Flight + Hotel booking, you need to change your Flight and Hotel separately. This means you can also make changes to only the Flight or the Hotel in your combination."]
        },
        {"tag": "BookFlightHotel",
         "patterns": ["how to book a flight and hotel", "book a flight and hotel", "I want to book a flight and hotel", "steps for booking a flight and hotel", "I dont know how to book a flight and hotel", "how can I book a flight and hotel"],
         "responses": ["1. Enter your destination, travel dates and stay duration in the search box. \n2. On the search results page, select any Flight + Hotel Combination that you like. \n3. You can customize the Flight + Hotel combination. Simply tap CHANGE on Your Flight section when using Traveloka App, or click Change Room or Change Flight when using Traveloka desktop. \n4. Review your trip summary and click Select to continue. Fill in contact and traveler details, and make sure all details are correct. Then, proceed with payment. \n5. Once we have received your payment, your flight e-ticket and hotel voucher will be sent to your email within 60 minutes."]
        },  
        {"tag": "confirmingTrainBooking",
         "patterns": ["How to confirm a train ticket booking?", "I want to confirm my train booking.", "When will my train ticket booking be confirmed?", "Where can I find my train ticket?", "how to see my train ticket booking"],
         "responses": ["Your booking is confirmed as soon as you receive your e-ticket, which contains a booking code from PT Kereta Api Indonesia. You should be able to find your e-ticket in your email, SMS, and on My Booking."]
        },	
        {"tag": "CancelAndGetRefundTrainBooking",
         "patterns": ["How to cancel a train ticket booking", "How to refund my train tickets", "Can I apply for a train ticket refund?", "Where can I get a train ticket refund?", "how to cancel a train ticket booking"],
         "responses": ["Based on PT KAI's policy, refund can only be requested at the station. It does not have to be your departure station, just any PT KAI stations that are designated for refund."]
        },
        {"tag": "TrainETicket",
         "patterns": ["how to use train e-ticket", "I want to use e-ticket for train booking", "Where can I use e-ticket for train", "I want to book a train with e-ticket", "I want to book a train with e ticket", "how to use electronic ticket for train"],
         "responses": ["On the day of your departure, you have to bring your Traveloka e-ticket to the departure station. Please make sure to arrive at the station at the latest 60 minutes before your departure schedule. Upon your arrival at the station, please follow these steps:\n1. Go to the check-in machine.\n2. Open My Booking on your Traveloka App and find your e-ticket.\n3. Enter the booking code or scan the barcode at the machine.\n4. Print your boarding pass.\n\n For further information: https://www.traveloka.com/en-id/help/train/train-info/train-check-in/using-your-train-e-ticket"]
        },
        {"tag": "RescheduleRerouteTrainBooking",
         "patterns": ["how to reschedule a train booking", "How to reroute train booking", "I want to reschedule my train booking","How do I change a train ticket booking?", "Where can I apply for a train ticket reroute?", "can i reschedule my train ticket booking?", "What should I do if I want to reschedule or reroute my train ticket booking?"],
         "responses": ["Based on PT KAI's policy, rescheduling can only be requested at the station. It does not have to be your departure station, just any PT KAI stations that are designated to serve refund and reschedule requests."]
        },
        {"tag": "kaiTravelRegulationUpdate",
         "patterns": ["the latest info on traveling with kai", "what's the latest updates on traveling with kai?", "What are the regulations regarding traveling with kai?", "show regulations related to kai", "regulations regarding traveling with kai?", "what are the rules if I want to use kai?"],
         "responses": ["In an effort to curb the spread of COVID-19, KAI is following regulations regarding travel requirements for passengers who are taking KAI's long distance trains in Java and Sumatra. Please go to our https://trv.lk/kai-covid  page, and check the updated travel regulation applied."]
        },
        {"tag": "rescheduleHotelBooking",
         "patterns": ["how to reschedule a hotel booking", "I want to reschedule my hotel booking", "Can I reschedule my hotel booking?", "I dont know how to reschedule my hotel booking", "reschedule my hotel booking"],
         "responses": ["To reschedule your stay, you can use Easy Reschedule by following these steps:\n1. Log in to your Traveloka account on Traveloka App and go to My Booking.\n2. Select the booking you want to change.\n3. Scroll down to the Manage Booking section, then tap Reschedule.\n4. Enter your new stay date and tap Search.\nKeep in mind that rescheduling your booking may incur some fees. If you're planning to extend your stay instead of rescheduling, please Contact Us."]
        },
        {"tag": "cannotCheckInHotel",
         "patterns": ["I cannot check in hotel", "cannot check in at a hotel", "Can't check-in at the hotel", "why I cant check in at a hotel", "can not check in a hotel"],
         "responses": ["In the rare event that hotel cannot accommodate the booking due to certain reason, please follow these steps:\n1. Go to My Booking on your Traveloka App and select your hotel booking.\n2. Tap Need Check-in Help? At the top of your hotel voucher. This button will appear one day before your check-in date.\n3. Select a check-in issue that reflects your situation. Our Customer Service team will be alerted to your selection and will help you solve your issue.\nAlternatively, you can also Contact Us. Please have your Traveloka Booking ID ready."]
        },
        {"tag": "bookAHotel",
         "patterns": ["how to book a hotel", "book a hotel", "I want to book a hotel", "steps for booking a hotel", "I dont know how to book a hotel", "how can I book a hotel"],
         "responses": ["Book a hotel on Traveloka by following these steps:\n1. On the Traveloka homepage, tap Hotels. Fill in your destination, check-in date, duration of stay, number of guests and rooms, and preferences such as star ratings, price and the option to pay at hotel. Tap Search.\n2. Choose the hotel that suits your preference, and tap Select Room. Choose the room you want, and tap Select. Fill in your Contact Details, then tap Continue.\n3. Review your booking details, and tap Continue to proceed to payment. Select your payment method and make your payment. Once your payment is verified, you will receive your hotel voucher by email.\n4. Your booking status and details can also be found under Purchase List.\n\nFor further information: https://www.traveloka.com/en-id/help/v2/hotel/accommodation-booking/pre-booking/hotel-room-information/how-do-i-book-a-hotel-through-traveloka"]
        },
		{"tag": "cancelAndGetRefundHotel",
         "patterns": ["can I cancel my hotel booking?", "how to cancel my hotel booking and get refund?", "I want to cancel my hotel booking and get refund", "can I get refund if I cancel my hotel booking?", "cancel a booking hotel"],
         "responses": ["To cancel and get a refund for your hotel booking, follow these steps:\n1. Log in to your Traveloka account.\n2. Go to My Booking. Choose the booking you wish to cancel. Scroll down to the Manage Booking section, then tap Refund. Read the refund policy for your booking, then tap Refund to proceed with your request. Enter your password to proceed.\n3. Read the Refund Terms & Conditions, check the box to agree and tap Next. Select the room or unit that you wish to refund and tap Next. Check the box to agree to the Refund Terms & Conditions and tap Submit Refund.\nIf you do not have a Traveloka account, simply go to My Booking on your Traveloka App or click Retrieve Booking on the Traveloka desktop website.\n\n For further information: https://www.traveloka.com/en-id/help/v2/hotel/accommodation-booking/post-booking/cancelation-refund/can-i-cancel-my-hotel-booking"]
        },
        {"tag": "villaAndApartemen",
         "patterns": ["villas and apartments in traveloka", "what's in the villa?", "difference between villa and hotel", "is the apartment worth it?", "what is in the apartment", "facilities in apartment or villa"],
         "responses": ["Villas & Apartments offers various types of accommodations other than hotels for you to choose from. It is the right choice for you if you're looking for a comfortable, safe, and different staying experience. Villas & Apartments allows you to find properties worldwide."]
        },
		{"tag": "BookingVillaAndApartment",
         "patterns": ["how to book a villa?", "how to book an apartment?", "I want to book a villa", "book an apartment", "how can I book a villa?"],
         "responses": ["To book a villa or apartment, follow these steps:\n1. In the search box, fill in your destination, date of stay and number of guests, then tap Search.\n2. You will see a list of properties and their prices. Choose one that matches your preferences.\n3. Fill in contact and guest details, and then continue to payment.\n4. Choose your preferred payment method, and then proceed with payment.\n5. Once your payment has been verified, you will receive an email from Traveloka containing your e-voucher. You can also check your booking status on My Booking."]
        },
        {"tag": "registerAccessTravelokaPay",
        "patterns": ["how do I register to traveloka Pay?", "how do I access traveloka Pay", "I dont know how to use travelokaPay", "where can I find travelokaPay", "I want to register travelokaPay", "how to book using travelokaPay"],
        "responses": ["If you have a Traveloka account, you are automatically registered to a travelokaPay account. Please make sure you have logged in to your Traveloka account before making any bookings. Open your Traveloka App homepage or click travelokaPay to access the feature."]
        },
        {"tag": "paymentSupportedTravelokaPay",
        "patterns": ["What are the payment methods supported by travelokaPay?", "What payment methods are supported by travelokaPay?", "how to top up traveloka pay?", "payment methods to top up travelokaPay"],
        "responses": ["My Cards\nMy Cards is one of the fastest ways to pay for your purchases at Traveloka. By adding your credit cards to My Cards, you only need to fill in your credit card details once. The next time you are using it, all you have to do is pick a card and pay. You may even complete your booking process in under 60 seconds!\n\nUANGKU Balance\nUANGKU Balance is an electronic money product issued by PT Smartfren Telecom Tbk. It allows you to top up your balance and enjoy the convenience of a faster check-out for your Traveloka purchases anytime, anywhere. Use UANGKU Balance whenever you feel like paying in cash! \nWe also offer other payment methods to ease your booking, such as transfer, Internet banking, and counter payment."]
        },
        {"tag": "verificationStatus",
        "patterns": ["How do I check my account verification status?", "How long does it take to verify an account?", "check my verification status", "where can I find my verification status", "when is my verification successful"],
        "responses": ["You can check your account verification status by accessing the travelokaPay menu. Your status will appear under your username.\nYour account verification process will only take up to 24 hours."]
        },
        {"tag": "haventReceiveTicketButPaid",
        "patterns": ["I Haven't Received My Ticket but I Have Paid", "I've paid the ticket but haven't received it", "why haven't I received the ticket even though I already paid for it", "what should I do if I haven't got the ticket I paid for", "already paid but haven't received the ticket"],
        "responses": ["In order for your payment verification process to be smooth and your ticket issued immediately, it is important to follow the payment instructions that we have provided.\nIf you are using transfer and ATM payment methods, please ensure that you follow all payment instructions including entering the appropriate account number and payment amount so that your payment can be processed automatically by the system.\nIf after you have made a payment, but after 10 minutes you have not received your ticket, then immediately upload / upload your proof of payment by:\n1. Go to the traveloka app\n2. Tap my order menu\n3. Open your reschedule order\n4. Then tap upload your proof of payment. the manual verification process takes 60 minutes after you successfully upload proof of payment.\nIf the steps above cannot be done, then please go to Contact Us and enter your proof of payment."]
        },
        {"tag": "wrongTransferTraveloka",
        "patterns": ["I Make a Wrong Transfer to Traveloka", "wrong transfer to traveloka", "what should I do if I transfer wrongly to traveloka", "already made a payment but it's wrong", "I have transferred to Traveloka but it's wrong"],
        "responses": ["If you have already making the payment to Traveloka but does not have a booking id or booking number, then feel free to contact us via Contact Us\nBefore you contact us, please prepare some data that we may need for further checking:\n1. The email you used\n2. Proof of Payment / Bank statement statement (choose one)\n3. Photo of the front page of the passbook containing information (if you use an online account, please display the screenshot of the application you are using)[Bank name, Account number, Name of Account Holder, Branch Office Opening\n4. Reasons why transfer to Traveloka without making a booking"]
        },
        {"tag": "purchaseExtraBaggage",
        "patterns": ["how to purchase extra baggage?", "I want extra baggage for flight", "I want to add extra baggage", "how can I add extra baggage for the flight", "purchase extra baggage"],
        "responses": ["Before your e-ticket is issued\n1. Proceed with your flight booking: Fill in your flight details, select your flight and fill in your contact and traveler details.\n2. Tap Continue. Under Flight Facilities, tap Baggage. Choose your desired baggage allowance and tap Done.\n3. The amount you need to pay for the extra baggage will be added to the Price You Pay. Tap Continue to proceed with your booking.\n\nAfter your e-ticket has been issued\nIf your e-ticket has been issued, you can purchase extra baggage during check-in at the airport, or by contacting the airline directly.\nTo find your airline's call center number, go to Flights on the homepage of the Traveloka website and under Airline Partners, simply click your airline's logo.\n\nThings to note:\nEach airline applies a different time limit for extra baggage purchase. To check the time limit applied by your airline, open your e-ticket and click the link under the Airline Conditions of Carriage section\nIf you have already checked in, you can no longer purchase extra baggage.\nFor further information: https://www.traveloka.com/en-id/help/v2/flight/flight-additional-services/flight-services/baggage/purchasing-extra-baggage"]
        },
        {"tag": "claimingBusinessTravelReimbursement",
        "patterns": ["can I claim reimbursement for my business travel", "how to claim reimbursement for my business travel", "claim reimbursement for my business travel", "what should i do to claiming reimbursement for my business travel", "i want to reimburse business travel", "i dont know how to reimburse travel"],
        "responses": ["To make claiming your reimbursement easier, we can give you a reference letter to your employer informing the total price of your transaction and that the transaction is valid and paid to Traveloka. \nTo request a reference letter, please go to this link and provide us with the details below: \n1. Your Traveloka Booking ID \n2. Your company name and complete address \n3. Your contact number \n4. Your office phone number \n5. Your tax ID (NPWP) \nIt's important to note that we cannot modify any receipt. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/general-payment-info/claiming-reimbursement-for-my-business-travel"]
       },
        {"tag": "mergeAccounts",
        "patterns": ["How to Merge My Accounts", "can i merge my account", "what should i do to merge account", "merge account", "merging account"],
        "responses": ["Unfortunately, merging your Traveloka accounts is not possible. This means that you can't transfer Points, merge Passenger Quick Pick lists, and merge credit cards between accounts. \nHowever, you can move email addresses/phone numbers from one account to another. Please note that if you move the main email address/phone number, the origin account will become inactive.\nIf you need to move a main email address/phone number from one account to another, please Contact Us.\nFor further information : https://www.traveloka.com/en-id/help/profile-security/profile-security-info/general-information/how-to-merge-my-accounts"]
       },
        {"tag": "refundRequestInInstallments",
        "patterns": ["can i request refund in installments payment", "how to request refund in installments payment", "i pay something with installments, can i request refund", "i dont know how to request refund if i pay with installments"],
        "responses": ["It depends on the product refund policy. However, Installment Fee could not be refunded. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/installment/installment-refund"]
       },
        {"tag": "travelokaCoupon",
        "patterns": ["what is traveloka coupon", "i dont know what traveloka coupon is", "can you tell me what is traveloka coupon", "traveloka coupon meaning", "traveloka coupon is what?"],
        "responses": ["Traveloka coupons are codes that you may use when purchasing a Traveloka product. When you enter a Traveloka coupon code during the payment process, you will be entitled to a discount. \nTo use a Traveloka coupon, follow these steps: \n1. On the Traveloka homepage, under Ongoing Promo, tap See All Promo. Select the category that interests you. Copy the coupon code on the promo that you want. \n2. Make your booking and proceed to payment. \n3. Select your payment method. On the Coupon box, tap Add. Paste the coupon code in the box and tap Add again. Your Total Price will be adjusted. Tap Done and make your payment. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/traveloka-coupon/what-are-traveloka-coupons"]
       },
        {"tag": "howToObtainTravelokaCoupon",
        "patterns": ["how to obtain traveloka coupon", "i want to obtain coupon", "what steps i should do to obtain coupon", "can i obtain coupon", "I want to get Traveloka coupon", "how can I get traveloka coupon"],
        "responses": ["Traveloka distributes exclusive coupons to our newsletter subscribers and during promo campaigns, so don't miss out! You can sign up for our newsletter here. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/traveloka-coupon/how-can-i-obtain-a-traveloka-coupon"]
       },
        {"tag": "availablePaymentMethods",
        "patterns": ["what is payment methods that available in traveloka", "i want to know what payment methods that available", "available payment methods", "traveloka payment methods"],
        "responses": ["We accept the following payment options: \n1. Transfer (ATM/SMS Banking/e-Banking/bank teller) \n2. ATM (all ATM with the logo of Bersama, Prima and Alto) \n3. Credit Card (Visa/Mastercard) \n4. Internet Banking (BCA KlikPay, Mandiri ClickPay and CIMB Clicks) \n5. Indomaret stores \n6. Alfamart stores \n7. UANGKU Balance \nPlease make sure your transferred amount goes to the bank account under the name PT Trinusa Travelindo, and NOT to personal bank accounts. Beware of fraud. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/paying-in-idr/what-are-the-payment-methods-accepted-for-idr-transactions"]
        },
        {"tag": "cantDownloadTraveloka",
        "patterns": ["why i cant download traveloka in my device", "is my device meet the requirements to download traveloka", "how do i know that my device is compatible", "i cant download traveloka", "why i cant download traveloka"],
        "responses": ["To install Traveloka App on Android, your device needs to have at least Android Operating System (OS) 4.0 Ice Cream Sandwich. To install Traveloka App on iOS, your device needs to have at least iOS 7. Please also make sure that your device is connected to a stable 3G (at minimum) or WiFi connection. \nFor further information : https://www.traveloka.com/en-id/help/general-info/learn-about-traveloka/traveloka-app/why-cant-i-download-traveloka-app-on-my-device"]
        },
        {"tag": "cancelInstallmentsRequests",
        "patterns": ["can i cancel my installments request", "how to cancel my installments request", "what must i do to cancel my installments request", "cancel installment request", "cancelling installments requests"],
        "responses": ["Unfortunately, all installment requests and processes are final and cannot be canceled. \nFor further information : https://www.traveloka.com/en-id/help/general-info/general-information-payment/installment/cancel-installment"]
        }
   ]
}